In [2]:
!jt -t chesterish

In [2]:
import numpy as np

In [3]:
import pandas as pd

In [24]:
#From Dictionary
data={'name': ['Alice','Bob','Charlie'],'age':[25,30,25]}
df =pd.DataFrame(data)
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [25]:
print(df.columns)

Index(['name', 'age'], dtype='object')

In [26]:
#From list of lists
data=[['Alice',25],['Bob',30],['Charlie',35]]
df=pd.DataFrame(data)

In [27]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [28]:
df.columns

RangeIndex(start=0, stop=2, step=1)

In [29]:
df.columns=['name','age']

In [30]:
df1=pd.DataFrame(data,columns=['name','age'])

In [31]:
df1

      name  age
0    Alice   25
1      Bob   30
2  Charlie   35

In [32]:
df['name']

0      Alice
1        Bob
2    Charlie
Name: name, dtype: object

In [33]:
type(df['name'])

pandas.core.series.Series

In [34]:
list_col=['name','age']
df[list_col]
#df[['name','age']]

      name  age
0    Alice   25
1      Bob   30
2  Charlie   35

# condition based Filtering

In [42]:
df['age'] >=30

0    False
1     True
2     True
Name: age, dtype: bool

In [43]:
df[df['age'] >=30]

      name  age
1      Bob   30
2  Charlie   35

In [47]:
df[df['name'].str.startswith('A') & (df['age']>=25)]

    name  age
0  Alice   25

In [58]:
df['age'].isna()

0    False
1    False
2    False
Name: age, dtype: bool

In [59]:
df[df['age'].isna()]

Empty DataFrame
Columns: [name, age]
Index: []

### Filtering using existing methods

In [66]:
df.loc[0:1:1,['name','age']]
#df.loc[0:1:1,'name':'age']

    name  age
0  Alice   25
1    Bob   30

In [71]:
df.iloc[0,0]

'Alice'

In [72]:
df.iloc[0:2, [0,1]]

    name  age
0  Alice   25
1    Bob   30

In [74]:
df.at[2,'name']

'Charlie'

In [77]:
df.iat[1,1]

30

## Reading and writing  data

In [13]:
#df=pd.read_csv('./../data.csv')
df=pd.read_csv("./data.csv")
df

    name  age
0  Alice   25
1    Bob   30

In [14]:
df.to_csv('./data.csv',index=False)

## Data Exploration

In [15]:
# df.head()
df.head(2)

    name  age
0  Alice   25
1    Bob   30

In [16]:
df.tail(2)

    name  age
0  Alice   25
1    Bob   30

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    2 non-null      object
 1   age     2 non-null      int64
dtypes: int64(1), object(1)
memory usage: 160.0+ bytes

In [18]:
df.describe()

             age
count   2.000000
mean   27.500000
std     3.535534
min    25.000000
25%    26.250000
50%    27.500000
75%    28.750000
max    30.000000

In [20]:
df.value_counts()

name   age
Alice  25     1
Bob    30     1
Name: count, dtype: int64

In [23]:
df['age'].nunique()

2

In [24]:
df.shape

(2, 2)

In [25]:
df.isnull()

    name    age
0  False  False
1  False  False

In [26]:
df.isnull().sum()

name    0
age     0
dtype: int64